**복습문제**
- requests를 이용해 영화 목록과 예매율, 주요정보를 수집하세요.
- 영화목록과 주요정보는 딕셔너리로 구성되어야 합니다.
- http://www.cgv.co.kr/movies/

In [24]:
import requests
from bs4 import BeautifulSoup 



url = 'http://www.cgv.co.kr/movies/'
res = requests.get(url)
soup = BeautifulSoup(res.text, 'html.parser')

for movie_title in soup.find_all('strong', class_="title"):
    print(movie_title.text.strip())
    
for reservation_percent in soup.find_all('strong', class_="percent"):
    percent = reservation_percent.find('span').text
    print(percent)
    
    
for box_contents in soup.find_all('div', class_="box-contents"):
    title_id_list = box_contents.find('a').attrs['href']
    res_detail = requests.get(f'http://www.cgv.co.kr{title_id_list}')
    soup = BeautifulSoup(res_detail.text, 'html.parser')
    div = soup.find_all('div', class_="sect-story-movie")
    for main_story in div:
        print(main_story.text)

블랙 팬서-와칸다 포에버
동감
데시벨
폴-600미터
심야카페-미씽 허니
에브리씽 에브리웨어 올 앳 원스
한산 리덕스
첫번째 아이
극장판 소드 아트 온라인 -프로그레시브- 짙은 어둠의 스케르초
바르도, 약간의 진실을 섞은 거짓된 연대기
파이어버드
극장판 짱구는 못말려-수수께끼! 꽃피는 천하떡잎학교
자백
같은 속옷을 입는 두 여자
[씨네뮤지엄] 누구나 알지만 아무도 잘 모른다, 피카소
인생은 아름다워
트랜스
알카라스의 여름
가재가 노래하는 곳
28.2%
18.3%
16.0%
4.5%
1.6%
1.3%
1.2%
0.6%
0.6%
0.5%
0.4%
0.3%
0.2%
0.2%
0.1%
0.1%
0.1%
0.0%
0.0%

“와칸다를 지켜라!”
거대한 두 세계의 충돌, 운명을 건 최후의 전투가 시작된다!

국왕이자 ‘블랙 팬서’인 '티찰라'의 죽음 이후
수많은 강대국으로부터 위협을 받게 된 '와칸다'.
'라몬다', '슈리' 그리고 '나키아', '오코예, '음바쿠'는
각자 사명감을 갖고 '와칸다'를 지키기 위해 외로운 싸움을 이어간다.

한편, 비브라늄의 패권을 둘러싼 미스터리한 음모와 함께
깊은 해저에서 모습을 드러낸 최강의 적 '네이머'와 '탈로칸'의 전사들은
'와칸다'를 향해 무차별 공격을 퍼붓기 시작하는데…



                1999년, '용'은 첫눈에 반하게 된 '한솔'을 사로잡기 위해
친구에게 HAM 무전기를 빌린다.

2022년, ‘무늬’는 인터뷰 과제를 위해
오래된 HAM 무전기를 작동시킨다.

"씨큐... 씨큐... 제 목소리 들리세요?"

개기 월식이 일어난 날,
시간을 뛰어넘어 기적처럼 연결된 ‘용’과 ‘무늬’는
서로의 사랑과 우정을 이야기하며 특별한 감정을 쌓아가는데...

1999 - 2022
마음을 수신합니다.


소음이 커지는 순간 폭.발.한.다

물이 끓는 주전자 소리, 창문 여는 소리, 놀이터 아이들의 웃음 소리…
잠시 후, 거대한 굉음과 함께 단독 주택이 폭발했다는 뉴스 속보가 전해진다.
그리고, 뉴스를 지켜보던 전직 해군 부함장(김래원)에게 걸려온 전화

“소음이 커지면 터집니다. 다음 타깃은 축구 경기장이에요”

사태를 파악할 겨를도 없이, 관중들로 가득 찬 축구 경기장을
다음 테러의 타깃으로 지목하는 폭탄 설계자(이종석)

소음이 커지는 순간 폭발하는 특수 폭탄의 위협은 계속되고,
사상 최대의 도심 폭탄 테러를 막기 위해 모든 비밀을 손에 쥔 폭탄 설계자를 찾아야만 하는데…

도심 한복판에서 벌어지는 사운드 테러 액션
오늘 반드시 이 폭발을 막아야만 한다!


사상 최초 고공 서바이벌
지상에서 가장 높은 600m 타워
내려갈 단 하나의 길이 끊겼다!
핸드폰 먹통
식량 전무
잠들면 추락
한계 초과! 압도적 스릴!
지금껏 없었던 고소공포에 전율한다!


♥우리 결혼합니다!
부산 산복지구대의 냉미녀 경찰, 윤
파스타집 오너 셰프 다정한 연인, 태영
누구 봐도 행복한 커플 윤과 태영은 결혼을 앞두고 있다.

＃결혼식 당일 연인이 사라졌다!
누구보다 행복해야 할 결혼식 당일
태영이 아무 연락도 없이 나타나지 않는 대참사를 겪게 된다.

★시공초월 심야카페…?
갑자기 사라진 연인 태영의 행방이 묘연한 가운데 윤은 태영이 사라진 마지막 장소에서 수상한 지도를 발견한다.
지도를 따라간 윤은 평소에는 전혀 보지 못했던 카페를 발견하게 되는데…
마스터부터 손님까지 모두 수상하기만 한 ‘심야카페’에서 윤은 드디어 사라진 연인 태영을 만나게 된다.
하지만 태영은 자신을 알아보지 못하고 어딘지 어려보이기까지 하는데…
“저기.. 혹시 지금이 몇 년도인가요?”

밤 12시부터 해 뜰 때까지… 시공간이 초월된 그 곳
올 가을, 새로운 시공초월 로맨틱 판타지 세계로 초대합니다!
어서오세요, 심야카페입니다!


                미국에 이민와 힘겹게 세탁소를 운영하던 에블린은 세무당국의 조사에 시달리던 어느 날
남편의 이혼 요구와 삐딱하게 구는 딸로 인해 대혼란에 빠진다.
그 순간 에블린은 멀티버스 안에서 수천, 수만의 자신이 세상을 살아가고 있다는 사실을 알게 되고,
그 모든 능력을 빌려와 위기의 세상과 가족을 구해야하는 운명에 처한다.


나라의 운명을 바꾼 승리의 전투
못다 한 이야기가 밝혀진다!

1592년,
임진왜란 발발 후 15일만에 한양을 빼앗긴 절체절명의 위기에 놓인 조선.
명나라로 향하는 야망을 꿈꾸며 연승에 힘입어 한산도 앞바다까지 당도한 파죽지세의 왜군.

앞선 전투로 손상된 거북선의 출정 불가, 왜군의 연합을 통한 절대적인 군사적 열세인 상황,
조선 장수들의 의견 또한 첨예하게 맞서며 이순신 장군의 고뇌 또한 깊어진다.

나아갈 곳도 물러설 곳도 없는 풍전등화와 같은 상황 속,
이순신 장군은 조선의 운명을 건 압도적 승리를 위한 전투를 준비한다.

1592년 음력 7월 8일 한산도 앞바다,
승리의 이야기는 아직 끝나지 않았다!


                첫 아이가 태어나고 일 년 후 ‘정아’는 회사에 복직한다.
사회초년생 ‘지현’은 계약 연장을 위해 ‘정아’의 자리를 꿰차려 하고
타지에서 가족의 생계를 책임져야 하는 ‘화자’는 ‘정아’의 첫번째 아이를 돌보게 된다.
그러던 어느 날, ‘정아’는 아이가 사라졌다는 연락을 받고
세 여자는 ‘정아’의 첫 아이로 얽히고설킨다.

여자들에게 아이는 문제일까? 답일까?
모두가 풀고 싶은 그녀들의 딜레마를 만난다.


                세계 최초의 VRMMORPG <소드 아트 온라인>이 데스 게임으로 변하면서,
1만 명의 플레이어들이 게임 세계에 갇혀 버린 이후, 이미 한 달 이상이 경과했다.
강철의 부유성 '아인크라드' 제1층을 공략한 아스나는 키리토와 콤비를 맺고 최상층을 목표로 여행을 이어가고 있었다.
정보상 아르고의 협력도 더해져서, 공략은 순조롭게 진행되는 것 같았지만...
'아인크라드' 공략을 선도하는 2대 길드의 대립이 발생하고,  새로운 위협이 아스나와 키리토를 끌어들이기 시작한다.


                뛰어난 영상미와 몰입의 경험을 선사할 장대한 영화

<바르도, 약간의 진실을 섞은 거짓된 연대기>는 멕시코 출신의 저명한 저널리스트이자 다큐멘터리 감독인 실베리오가
로스앤젤레스에서 고향인 멕시코로 떠나는 사적이고 감동적인 여정을 그린다.
명망 있는 국제 시상식의 수상자로 지명된 실베리오는 고국을 다시 찾고 싶은 강한 충동을 느낀다.
그때는 이 간단한 여행이 자신을 실존적 한계로 몰고 가게 될 줄은 꿈에도 생각지 못한다.
그가 경험하는 기억의 어리석음과 두려움이 현재로 관통해 들어오면서 실베리오의 일상은 당혹감과 경이로움으로 채워지게 된다.
실베리오는 때로는 뭉클하게, 또 때로는 웃음을 자아내며, 보편적인 동시에 매우 사적인 질문들을 붙들고, 씨름하기 시작한다.
정체성, 성공, 죽음이라는 한계, 멕시코의 역사, 그리고 아내, 아이들과 공유하는 가족이라는 깊은 정서적 유대까지 그의 질문은 이어진다.
그리고 이 매우 독특한 시대에 과연 인간이라는 것이 무엇을 의미하는지도.


                1977년 냉전 시대의 에스토니아,
군 기지에서 복무 중이던 젊은 군인 ‘세르게이’는 새로 온 전투기 조종사 ‘로만’에게 첫눈에 이끌린다.
위태롭게 선을 넘나들던 두 남자는 모든 게 금지된 시대에 위험한 사랑을 시작한다.


짱구와 친구들, 명문학교에 입학하다?!

명문 엘리트 양성학교에 체험 입학하게 된 짱구와 친구들!
좋은 성적을 내서 학교에 정식 입학하고 싶은 철수와 장난만 치려는 짱구는 크게 싸우게 된다.
그러던 중 학교에 도는 괴소문의 존재 ‘흡덩귀’에게 철수가 엉덩이를 물린 채 발견된다.
‘흡덩귀’에게 엉덩이를 물리면 엘리트 학생도 모지리로 변하게 되는데….
철수와 학생들을 구하기 위해 짱구와 떡잎마을 방범대 친구들은 탐정 동아리를 결성하고 수사를 시작한다!

범인은 과연 누구? 짱구는 사건을 해결하고 철수와의 우정을 지킬 수 있을까?!


제대로 함정에 빠졌다!

불륜 사실을 폭로하겠다는 협박을 받고 향한 호텔에서 의문의 습격을 당한 유민호(소지섭).
정신을 차려보니 함께 있던 김세희(나나)는 죽어있고, 범인은 흔적도 없이 사라졌다.

하루아침에 성공한 사업가에서 밀실 살인 사건의 유일한 용의자로 누명을 쓴 유민호는
무죄를 입증하기 위해 승률 100%의 변호사 양신애(김윤진)를 찾는다.

눈 내리는 깊은 산속의 별장에서 마주한 두 사람,
양신애는 완벽한 진술을 위해 처음부터 사건을 재구성해야 한다고 말하고,
사건의 조각들이 맞춰지며 유민호가 감추고 있던 또 다른 사건이 모습을 드러내게 되는데…

두 개의 사건, 두 개의 시신
숨겨진 진실이 밝혀진다.


                여느 날과 다름없이 다투던 중,
마트 주차장에서 ‘수경’이 탄 차가 ‘이정’을 덮치는 사고가 발생한다.

‘수경’은 급발진을 주장하지만,
‘이정’은 고의라고 확신하고 있는 상황.

이제, ‘이정’은 ‘수경’으로부터
마땅히 받았어야 할 마음을 돌려받고자 한다.

각기 다른 사이즈의 마음 대신
같은 속옷을 입는 두 여자의 세계



                모두에게 천재라는 이름으로 불렸던 사람. 그러나 본인만큼은 천재로 생각하지 않았던 사람 파블로 피카소.
독특하고 신기하게만 보이는 그의 그림을 파헤쳐 보자. 그가 그리하여야만 했던 이유, 그의 화폭 속 이야기와 삶의 고뇌를 그의 작품을 통해 들여다본다.
- 주요작품: 첫 영성체, 아비뇽의 처녀들, 게르니카 등

1. 전설의 시작
모든 것은 바르셀로나에서 시작되었습니다.
어린 시절부터 이미 천재성을 드러낸 피카소의 이야기를 만나보고, 끊임없이 자신만의 길을 개척해 나갔던 그의 삶을 들여다봅니다.

2. 모멘텀 피카소
충격의 땅 파리. 처음으로 좌절이라는 경험을 그에게 선사해 준 곳 파리. 그러나 다시 일어서는 피카소만의 열정과 그 원동력의 힘을 알아봅니다.

3. 고발자 피카소
“붓은 총보다 강하다.”
자신만의 굳건한 회화 영역을 구축하면서도 끊임없이 사회의 문제를 밝혀 내었던 화가이자 철학자 피카소의 가치관을 느껴봅니다.

■ 아트가이드 소개

백인필 아트가이드 / 문화예술교육사

現 용인문화재단 근무 / 한국자전거나라 강사
前 문화역서울284 정규 도슨트
前 본태박물관 전시해설사
前 유로자전거나라 스페인 팀
 '15~'19 마드리드 프라도미술관 가이드
'13~'19 바르셀로나 피카소미술관 가이드


생애 가장 빛나는 선물
모든 순간이 노래가 된다!

무뚝뚝한 남편 ‘진봉’과 무심한 아들 딸을 위해 헌신하며 살아온 ‘세연’은
어느 날 자신에게 시간이 얼마 남지 않았다는 것을 알게 된다.
한 치 앞도 알 수 없는 인생에 서글퍼진 ‘세연’은 마지막 생일선물로
문득 떠오른 자신의 첫사랑을 찾아 달라는 황당한 요구를 한다.
막무가내로 우기는 아내의 고집에 어쩔 수 없이 여행길에 따라나선 ‘진봉’은
아무런 단서도 없이 이름 석 자만 가지고 무작정 전국 방방곡곡을 누빈다.
시도 때도 없이 티격태격 다투던 두 사람은 가는 곳곳마다
자신들의 찬란했던 지난날 소중한 기억을 하나 둘 떠올리는데...
과연 ‘세연’의 첫사랑은 어디에 있으며 그들의 여행은 무사히 마칠 수 있을까?


“트랜스휴머니즘이라고 들어봤니?”

학교에서 괴롭힘을 당하던 소녀,  민영.
같은 반 이태에게 ‘트랜스휴먼’에 대해 듣게 되고
인류 진화 프로젝트에 합류한다.


“지금 넌, 네 머릿속에 있어”

자신을 괴롭히던 마태용의 시체가 학교에서 발견되고
민영은 범인으로 지목되며 혼란에 빠진다.
‘타임루프’를 헤매며 진실을 밝히기 위한 민영의 고군분투가 시작된다.




                해가 내리쬐는 작은 마을, 알카라스
매 여름마다 복숭아를 수확하기 위해
3대째 모이는 솔레 가족은 찬란한 계절을 누린다

탐스러운 복숭아처럼 영글어가는 가족의 이야기
그 해 여름의 복숭아는 저마다의 기억으로 자란다


습지 소녀로 불리는 한 여자, 살인사건의 유력한 용의자로 지목되다.

어렸을 때 가족에게 버림받고 자연만이 유일한 친구였던 카야.
그녀가 세상과 단절된 채 성장하는 가운데, 테이트가 그녀의 마음을 두드린다.
하지만 그가 떠난 뒤, 밀려오는 외로움 속, 체이스가 그녀에게 적극적인 고백을 하고,
마음이 흔들리기 시작한다.
그러던 어느 날, 체이스는 습지에서 추락사로 싸늘한 시체로 발견되고
카야는 유력한 용의자가 되어 법정에 서게 되는데…

그녀의 비밀이 숨겨져 있는
가재가 노래하는 곳.

## **1. 데이터프레임**

- DataFrame은 판다스의 기본 자료구조입니다.
- DataFrame은 여러 series 컬럼으로 구성됩니다.
- 각 Series에는 데이터 타입이 있습니다.
- Excel spreadsheet이라고 생각하면 이해하기 쉽습니다.
- row는 각 개별 데이터를, column은 개별 속성을 의미

![image.png]()

**1-1) 빈 데이터프레임을 만들어봅시다**

In [25]:
import pandas as pd

df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

**1-2) 리스트를 이용하여 데이터프레임을 만들어봅시다.**

In [29]:
import pandas as pd
names = ['윈터', '카리나', '수빈', '승희']
english_score = [100, 95, 60, 88]
dic = {'이름':names, '영어성적':english_score}
df = pd.DataFrame(dic)
df

    이름  영어성적
0   윈터   100
1  카리나    95
2   수빈    60
3   승희    88

In [31]:
df['이름']

0     윈터
1    카리나
2     수빈
3     승희
Name: 이름, dtype: object

**1-3) 리스트에 값을 추가해봅시다.**

In [11]:
add_data = {'이름':'크롱', '영어성적':22} # 데이터 추가 
df2 = df.append(add_data, ignore_index=True) # append로 넣기. 새로운 곳에 다시 넣어줘야 한다. ignore_index도 해주기.
df2

    이름  영어성적
0   윈터   100
1  카리나    95
2   수빈    60
3   승희    88
4   크롱    22

**1-4) csv파일을 열어봅시다.**

In [16]:
# wget을 이용하면 쉽게 다운로드 받을 수 있어요.
!wget https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv

--2022-11-16 16:03:02--  https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.111.133, 185.199.108.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.111.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 60302 (59K) [text/plain]
Saving to: ‘titanic.csv’

titanic.csv         100%[===================>]  58.89K  --.-KB/s    in 0.01s

2022-11-16 16:03:02 (5.00 MB/s) - ‘titanic.csv’ saved [60302/60302]

In [33]:
# pd.read_csv

df = pd.read_csv('./titanic.csv')
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

**1-5) head, tail을 통해 데이터를 살펴봅시다.**

In [34]:
# head
# n=3
df.head()

df.head(n = 10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [20]:
# tail
# n=5
df.tail() # 뒤에 다섯개를 보여준다.

**1-6) 데이터 파악하기 (shape, describe, info)**

In [36]:
# shape

TypeError: 'tuple' object is not callable

In [37]:
# describe

df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [35]:
# info

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**1-7) 데이터 자르기**

In [38]:
df[10:15]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S

**1-8) 형변환(astype)**

In [42]:
df['Survived'] = df['Survived'].astype('bool') # boolean 타입으로 바꿨다.
print(df)

     PassengerId  Survived  Pclass  \
0              1     False       3
1              2      True       1
2              3      True       3
3              4      True       1
4              5     False       3
..           ...       ...     ...
886          887     False       2
887          888      True       1
888          889     False       3
889          890      True       1
890          891     False       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

**1-9) 컬럼 추출(columns, [])**

In [43]:
df[['Pclass','Survived', 'PassengerId']] # 여러개를 선택하고 싶으면 리스트안에 넣어준다.

     Pclass  Survived  PassengerId
0         3     False            1
1         1      True            2
2         3      True            3
3         1      True            4
4         3     False            5
..      ...       ...          ...
886       2     False          887
887       1      True          888
888       3     False          889
889       1      True          890
890       3     False          891

[891 rows x 3 columns]

**1-10) 행 추출(data.loc[[986, 100, 110, 990]])**
- loc
- iloc

In [45]:
df.loc[[1,5,10], ['Survived', 'Pclass']]

    Survived  Pclass
1       True       1
5      False       3
10      True       3

**1-11) 새로운 열 만들기**

In [46]:
df['tax'] = df['Fare'] / 10 # tax라는 컬럼이 생긴다.

## **2. 데이터프레임 실습**
1) csv파일을 다운받습니다.

2) head, tail을 통해 데이터를 살펴봅시다.

3) shape, describe, info로 데이터를 파악합시다.

3) 상위 10개와 하위 10개 데이터를 합쳐 20개 데이터를 만들어봅시다.

- 위/아래로 합치기 - 행 기준
- pd.concat([df1, df2], axis = 0)
- 옆으로 합치기 - 열 기준
- pd.concat([df1, df2], axis = 1)

https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv

In [52]:
iris_df = pd.read_csv('./iris.csv')

# head, tail 데이터 살펴보기
# iris_df.head()
# iris_df.tail()

# shape, describe, info 
# iris_df.describe()
# iris_df.info()
# print(iris_df.shape)

df1 = iris_df.head(10)
df2 = iris_df.tail(10)

df_mix = pd.concat([df1,df2], axis=0)
print(df_mix)

(150, 5)
     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
5             5.4          3.9           1.7          0.4     Setosa
6             4.6          3.4           1.4          0.3     Setosa
7             5.0          3.4           1.5          0.2     Setosa
8             4.4          2.9           1.4          0.2     Setosa
9             4.9          3.1           1.5          0.1     Setosa
140           6.7          3.1           5.6          2.4  Virginica
141           6.9          3.1           5.1          2.3  Virginica
142           5.8          2.7           5.1          1.9  Virginica
143           6.8          3.2           5.9          2.3  Virginica
144           6.7          3.3           5.7          2.5  Virginica
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

## **3. Boolean Selection**

In [54]:
# 30대면서 1등석에 탄 사람 선택하기
df = pd.read_csv('./titanic.csv')
class_ = df['Pclass'] == 1 # Pclass가 1인 친구들만 True로 만들어줌
age_ = (df['Age'] >= 30) & (df['Age'] < 40)

df[class_ & age_] # 나이 조건과 1등석 조건을 만족하는 모두를 출력하기

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN
137,138,0,1,"Futrelle, Mr. Jacques Heath",male,37.0,1,0,113803,53.1000,C123,S
215,216,1,1,"Newell, Miss. Madeleine",female,31.0,1,0,35273,113.2750,D36,C
218,219,1,1,"Bazzani, Miss. Albina",female,32.0,0,0,11813,76.2917,D15,C
224,225,1,1,"Hoyt, Mr. Frederick Maxfield",male,38.0,1,0,19943,90.0000,C93,S
230,231,1,1,"Harris, Mrs. Henry Birkhardt (Irene Wallach)",female,35.0,1,0,36973,83.4750,C83,S
248,249,1,1,"Beckwith, Mr. Richard Leonard",male,37.0,1,1,11751,52.5542,D35,S
257,258,1,1,"Cherry, Miss. Gladys",female,30.0,0,0,110152,86.5000,B77,S
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
269,270,1,1,"Bissette, Miss. Amelia",female,35.0,0,0,PC 17760,135.6333,C99,S
273,274,0,1,"Natsch, Mr. Charles H",male,37.0,0,1,PC 17596,29.7000,C118,C
309,310,1,1,"Francatelli, Miss. Laura Mabel",female,30.0,0,0,PC 17485,56.9292,E36,C
318,319,1,1,"Wick, Miss. Mary Natalie",female,31.0,0,2,36928,164.8667,C7,S
325,326,1,1,"Young, Miss. Marie Grice",female,36.0,0,0,PC 17760,135.6333,C32,C
332,333,0,1,"Graham, Mr. George Edward",male,38.0,0,1,PC 17582,153.4625,C91,S
383,384,1,1,"Holverson, Mrs. Alexander Oskar (Mary Aline To...",female,35.0,1,0,113789,52.0000,NaN,S
390,391,1,1,"Carter, Mr. William Ernest",male,36.0,1,2,113760,120.0000,B96 B98,S
412,413,1,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.0000,C78,Q
447,448,1,1,"Seward, Mr. Frederic Kimber",male,34.0,0,0,113794,26.5500,NaN,S
452,453,0,1,"Foreman, Mr. Benjamin Laventall",male,30.0,0,0,113051,27.7500,C111,C
486,487,1,1,"Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)",female,35.0,1,0,19943,90.0000,C93,S
512,513,1,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S
520,521,1,1,"Perreault, Miss. Anne",female,30.0,0,0,12749,93.5000,B73,S
537,538,1,1,"LeRoy, Miss. Bertha",female,30.0,0,0,PC 17761,106.4250,NaN,C
540,541,1,1,"Crosby, Miss. Harriet R",female,36.0,0,2,WE/P 5735,71.0000,B22,S
558,559,1,1,"Taussig, Mrs. Emil (Tillie Mandelbaum)",female,39.0,1,1,110413,79.6500,E67,S
572,573,1,1,"Flynn, Mr. John Irwin (""Irving"")",male,36.0,0,0,PC 17474,26.3875,E25,S
577,578,1,1,"Silvey, Mrs. William Baird (Alice Munger)",female,39.0,1,0,13507,55.9000,E44,S
581,582,1,1,"Thayer, Mrs. John Borland (Marian Longstreth M...",female,39.0,1,1,17421,110.8833,C68,C
583,584,0,1,"Ross, Mr. John Hugo",male,36.0,0,0,13049,40.1250,A10,C
604,605,1,1,"Homer, Mr. Harry (""Mr E Haven"")",male,35.0,0,0,111426,26.5500,NaN,C
632,633,1,1,"Stahelin-Maeglin, Dr. Max",male,32.0,0,0,13214,30.5000,B50,C
671,672,0,1,"Davidson, Mr. Thornton",male,31.0,1,0,F.C. 12750,52.0000,B71,S
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
690,691,1,1,"Dick, Mr. Albert Adrian",male,31.0,1,0,17474,57.0000,B20,S
701,702,1,1,"Silverthorne, Mr. Spencer Victor",male,35.0,0,0,PC 17475,26.2875,E24,S
716,717,1,1,"Endres, Miss. Caroline Louise",female,38.0,0,0,PC 17757,227.5250,C45,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
741,742,0,1,"Cavendish, Mr. Tyrell William",male,36.0,1,0,19877,78.8500,C46,S
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5000,B77,S
763,764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36.0,1,2,113760,120.0000,B96 B98,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S
809,810,1,1,"Chambers, Mrs. Norman Campbell (Bertha Griggs)",female,33.0,1,0,113806,53.1000,E8,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S
835,836,1,1,"Compton, Miss. Sara Rebecca",female,39.0,1,1,PC 17756,83.1583,E49,C
842,843,1,1,"Serepeca, Miss. Augusta",female,30.0,0,0,113798,31.0000,NaN,C
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S

**3-1) 실습: 성별이 남성이고, 사망한 사람들(survived==0)을 추출**

In [55]:
df = pd.read_csv('./titanic.csv')

male_ = df['Sex'] == 'male'
dead_ = df['Survived'] == 0

df[male_ & dead_]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

**3-2) 실습: 아이리스 데이터세트에서 Virginica이고 sepal.length가 5 이상인 데이터 추출**

In [57]:
iris_df = pd.read_csv('./iris.csv')

virginica_ = iris_df['variety'] == 'Virginica'
sepal_length_above_5 = iris_df['sepal.length'] >= 5

iris_df[virginica_ & sepal_length_above_5]

     sepal.length  sepal.width  petal.length  petal.width    variety
100           6.3          3.3           6.0          2.5  Virginica
101           5.8          2.7           5.1          1.9  Virginica
102           7.1          3.0           5.9          2.1  Virginica
103           6.3          2.9           5.6          1.8  Virginica
104           6.5          3.0           5.8          2.2  Virginica
105           7.6          3.0           6.6          2.1  Virginica
107           7.3          2.9           6.3          1.8  Virginica
108           6.7          2.5           5.8          1.8  Virginica
109           7.2          3.6           6.1          2.5  Virginica
110           6.5          3.2           5.1          2.0  Virginica
111           6.4          2.7           5.3          1.9  Virginica
112           6.8          3.0           5.5          2.1  Virginica
113           5.7          2.5           5.0          2.0  Virginica
114           5.8          2.8           5.1          2.4  Virginica
115           6.4          3.2           5.3          2.3  Virginica
116           6.5          3.0           5.5          1.8  Virginica
117           7.7          3.8           6.7          2.2  Virginica
118           7.7          2.6           6.9          2.3  Virginica
119           6.0          2.2           5.0          1.5  Virginica
120           6.9          3.2           5.7          2.3  Virginica
121           5.6          2.8           4.9          2.0  Virginica
122           7.7          2.8           6.7          2.0  Virginica
123           6.3          2.7           4.9          1.8  Virginica
124           6.7          3.3           5.7          2.1  Virginica
125           7.2          3.2           6.0          1.8  Virginica
126           6.2          2.8           4.8          1.8  Virginica
127           6.1          3.0           4.9          1.8  Virginica
128           6.4          2.8           5.6          2.1  Virginica
129           7.2          3.0           5.8          1.6  Virginica
130           7.4          2.8           6.1          1.9  Virginica
131           7.9          3.8           6.4          2.0  Virginica
132           6.4          2.8           5.6          2.2  Virginica
133           6.3          2.8           5.1          1.5  Virginica
134           6.1          2.6           5.6          1.4  Virginica
135           7.7          3.0           6.1          2.3  Virginica
136           6.3          3.4           5.6          2.4  Virginica
137           6.4          3.1           5.5          1.8  Virginica
138           6.0          3.0           4.8          1.8  Virginica
139           6.9          3.1           5.4          2.1  Virginica
140           6.7          3.1           5.6          2.4  Virginica
141           6.9          3.1           5.1          2.3  Virginica
142           5.8          2.7           5.1          1.9  Virginica
143           6.8          3.2           5.9          2.3  Virginica
144           6.7          3.3           5.7          2.5  Virginica
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

## **4. 일일과제**

알라딘 새로나온상품 크롤러 만들기

https://www.aladin.co.kr/shop/common/wnew.aspx?BranchType=1

- request 모듈을 이용하여 1에서 3페이지의 책을 수집합니다.
- URL, 책 이름, 책 정가, 책 소개를 수집하여 데이터프레임으로 만듭니다.
- 50%할인가 컬럼을 책 정가 칼럼을 이용하여 만듭니다.
- 50%할인가가 10000원 이상인 책들만 추출합니다.

In [85]:
import requests
from bs4 import BeautifulSoup 

dic = dict()

price_list = list()
title_list = list()
url_list = list()

for page in range(1,4):
    page_url = f'https://www.aladin.co.kr/shop/common/wnew.aspx?ViewRowsCount=25&ViewType=Detail&SortOrder=6&page={page}&BranchType=1&PublishDay=84&CustReviewRankStart=&CustReviewRankEnd=&CustReviewCountStart=&CustReviewCountEnd=&PriceFilterMin=&PriceFilterMax=&SearchOption='
    res = requests.get(page_url)
    soup = BeautifulSoup(res.text, 'html.parser')
    for a_tag in soup.find_all('a', class_='bo3'):
        url = a_tag.attrs['href']
        url_list.append(url)
        title = a_tag.find('b').text.strip()
        title_list.append(title)
        detail_url = requests.get(f'{url}')
        soup = BeautifulSoup(detail_url.text, 'html.parser')
        for price_tag in soup.find('div', class_='Ritem'):
            price = price_tag.text.strip()
            price = price[0:-1].replace(',', "")
            price_list.append(price)
            dic = {'책제목': title_list , '가격': price_list, 'URL': url_list }
            
df = pd.DataFrame(dic)

discount_ = df['discount']

                          책제목     가격  \
0   작은 아씨들 : 정서경 대본집 세트 - 전2권  48000
1             소설엔 마진이 얼마나 남을까  15000
2                  오늘 여기에, 우리  22000
3             세상에서 가장 아름다운 경기  16000
4           장례식 케이크 전문점 연옥당 2  21000
..                        ...    ...
69               수학보다 데이터 문해력  17000
70              아기 다람쥐의 크리스마스  14000
71                   잃어버린 옆모습  15000
72                오늘도 어질러진 채로  14000
73                  바이어가 몰려온다  16000

                                                  URL
0   https://www.aladin.co.kr/shop/wproduct.aspx?It...
1   https://www.aladin.co.kr/shop/wproduct.aspx?It...
2   https://www.aladin.co.kr/shop/wproduct.aspx?It...
3   https://www.aladin.co.kr/shop/wproduct.aspx?It...
4   https://www.aladin.co.kr/shop/wproduct.aspx?It...
..                                                ...
69  https://www.aladin.co.kr/shop/wproduct.aspx?It...
70  https://www.aladin.co.kr/shop/wproduct.aspx?It...
71  https://www.aladin.co.kr/shop/wproduct.aspx?It...
72  https://www.aladin.co.kr/shop/wproduct.aspx?It...
73  https://www.aladin.co.kr/shop/wproduct.aspx?It...

[74 rows x 3 columns]